Revit 2027 API
Subelement.IsValidSubelementReference Method
 Checks if given Reference identifies either a valid element or subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidSubelementReference(
	Document aDoc,
	Reference reference
)
Public Shared Function IsValidSubelementReference (
	aDoc As Document,
	reference As Reference
) As Boolean
public:
static bool IsValidSubelementReference(
	Document^ aDoc,
	Reference^ reference
)
static member IsValidSubelementReference :
        aDoc : Document *
        reference : Reference -> bool
Parameters
aDoc Document
 The document.
reference Reference
 The reference that identifies an element or subelement.
Return Value
Boolean
 True if %reference% identifies a valid element or subelement, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A reference to an element or subelement in a linked document is acceptable.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace